К вам пришел один владелец небольшого стартапа. Он предлагает сделать игру, которая поразит игровую индустрию. Вы, конечно же, соглашаешься, так как предложение звучит заманчиво.

Суть игры состоит в том, что есть 2 замка (атакующий и защищающийся), которые враждуют между собой. 
Пользователь играет за атакующий замок. Царю атакующего замка необходимо каждый
 раз просчитывать возможности захвата враждующего замка. Когда возможность будет достаточно большой, то необходимо, не задумываясь, атаковать.

В коде у вас изначально есть 2 объекта attacker и defender, которые являются аналогиями замков, и у которых есть свойства, отвечающие за количество боевых единиц каждого типа. Например, archer - это лучники, footSoldiers - пехотинцы, и т.д.: