// JavaScript-код с созданием переменных

/* 
Автор:
Светослав Богданов
*/

const myName = 'Светослав' присвойте этой переменной свое имя.
const mySurname = 'Богданов' присвойте этой переменной свою фамилию. Если не хотите ее указывать, то просто напишите пустую строку.
const myFavoriteDrink = 'Kefir' укажите свой любимый напиток.
const myFavoriteAnimal = 'Gav' укажите свое любимое домашнее животное.
cobst myFavoriteProgrammingLanguage =  вы просто обязаны указать JavaScript. Шутка) Конечно же присвойте значение на свое усмотрение.